# -*- coding: utf-8 -*-
import tkinter
def reset_set():
    lines2 = ['*Стоимость оценок (ТБ)*', '"2":\t2', '"3-":\t5', '"3":\t9', '"3+":\t14', '"4-":\t20', '"4":\t27',
              '"4+":\t34', '"5-":\t42', '"5":\t51', '"5+":\t60', '',
              '*Максимальных и минимальных оценок не учитывается*', '"Max":\t0', '"Min":\t0', '',
              '*Программа была запущена ранее*', 'NO', '', '*Коэффициенты при переводе ТБ*',
              '"Доклад за научность":\t2', '"Доклад за культуру":\t2', '"Оппонирование":\t2', '"Рецензирование":\t1',
              '', '*Название команды*', 'Teamname', '', '*Перевод ТБ в РБ*',
              '+---------+-----------+-----------+----------+-----------+----------+',
              '|    -    |     №1    |   №2,3,4  |    №2    |    №3,4   |  №3, 4   |',
              '+---------+-----------+-----------+----------+-----------+----------+',
              '|    -    | просто №1 | ТБ>=№1-10 | ТБ<№1-10 | ТБ>=№2-10 | ТБ<№2-10 |',
              '|  >=300  |     6     |     6     |    5     |     5     |    4     |',
              '| 230-299 |     5     |     5     |    4     |     4     |    3     |',
              '| 130-229 |     4     |     4     |    3     |     3     |    2     |',
              '|  60-129 |     3     |     3     |    2     |     2     |    1     |',
              '|   <60   |     2     |     2     |    1     |     1     |    0     |',
              '+---------+-----------+-----------+----------+-----------+----------+']
    file_set = open('res/settings.txt', 'w')
    for index in lines2:
        file_set.write(index+'\n')
    file_set.close()
    label.config(text='Настройки сброшены')
master = tkinter.Tk()
label = tkinter.Label(master, text="Нажмите кнопку сброса")
label.pack()
doklad = tkinter.Button(master, text="Жми сюда", command=reset_set, bg='green', fg='white')
doklad.pack()
master.mainloop()